DataProcessors/ЗавершениеДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗавершениеДня</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УрокиДня</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Урок</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Мероприятие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Был</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗавершениеДня/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодтвердитьЗавершение(Команда)
	ПровестиМероприятия()
КонецПроцедуры             

Процедура ПровестиМероприятия()
	Обработка = РеквизитФормыВЗначение("Объект");
	Для каждого Строка Из Объект.УрокиДня Цикл
		Если Строка.Был И (Строка.Урок.Проведен = Ложь) Тогда
			Мероприятие = Строка.Урок.ПолучитьОбъект();
			Мероприятие.Записать(РежимЗаписиДокумента.Проведение);
			Продолжить;	
		КонецЕсли;     
		Если (Строка.Был = Ложь) И (Строка.Урок.Проведен = Истина) Тогда
			Мероприятие = Строка.Урок.ПолучитьОбъект();
			Мероприятие.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Продолжить;	
		КонецЕсли;     
	КонецЦикла;        
КонецПроцедуры


&НаКлиенте
Процедура ДеньПриИзменении(Элемент)
	ОбновитьСписокУроков()
КонецПроцедуры                  

Процедура ОбновитьСписокУроков()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.УрокиДня.Очистить();  
	Обработка.УрокиДня.Загрузить(Документы.Мероприятие.УрокиДня(Объект.День));
	ЗначениеВРеквизитФормы(Обработка, "Объект")
КонецПроцедуры
